In [1]:
import sqlite3

In [3]:
#Adding data in table
db=sqlite3.connect("C:/Users/Admin/sports_database.db")
cur=db.cursor()

In [4]:
#Constraints----
#Unique – enter only unique values, no duplicate values
#Not null – no black values can be inserted in table
cur.execute("create table sport (id int primary key, sportname text unique, dateofevent date, country text not null)")

In [5]:
cur.execute("insert into sport values (1,'cricket','2021-11-9','England')")

In [6]:
#this line will throw error as sportname is duplicate – unique constraint failed
#cur.execute(“insert into sport values(2,’cricket’,’2018-08-02’,’SriLanka’)”)

In [7]:
cur.execute("insert into sport values(2,'Tennis','2018-08-02','SriLanka')")
print(cur.rowcount, "record(s) inserted")

1 record(s) inserted

In [8]:
results=cur.execute('select * from sport')
results.fetchall()

[(1, 'cricket', '2021-11-9', 'England'),
 (2, 'Tennis', '2018-08-02', 'SriLanka')]

In [10]:
#this query throw error : not null constraint : can not leave any field blank
#cur.execute(“insert into sport value(3,’Football’,’2022-05-30’,NULL)”)
Results=cur.execute("insert into sport values(3,'Football','2022-05-30','Australia')")
db.commit()

In [11]:
results=cur.execute('select *from sport')
results.fetchall()

[(1, 'cricket', '2021-11-9', 'England'),
 (2, 'Tennis', '2018-08-02', 'SriLanka'),
 (3, 'Football', '2022-05-30', 'Australia')]

In [12]:
#Employee database with DB and Python programmatically

In [67]:
import sqlite3

In [74]:
con=sqlite3.connect("C:/Users/Admin/emp_database2.db")

In [75]:
def sql_table(con):
    cur=con.cursor()
    cur.execute("create table employee (id integer primary key, name text, salary real, department text,position text, hiredate date)")

In [76]:
#calling function
sql_table(con)

In [77]:
cur=con.cursor()
cur.execute("insert into employee values(1,'Jack',9000,'HR','Manager','2019-07-09')")

In [78]:
con.commit;

In [79]:
results=cur.execute("select * from employee")
results.fetchall()

[(1, 'Jack', 9000.0, 'HR', 'Manager', '2019-07-09')]

We can also pass values/arguments to an INSERT statement in the execute() method. You can use the question mark (?) as a placeholder for each value. The syntax of the INSERT will be like the following:

cur.execute(‘’’insert into employee(id,name,salary,department,position,hiredate) values(?,?,?,?,?,?)’’’,entities)
entities=(2,’John’4000,’IT’,’Engineer’,’2018-02-06’)

In [80]:
def sql_insert(con,entities):
    cur=con.cursor()
    cur.execute('insert into employee(id,name,salary,department,position,hiredate) values(?,?,?,?,?,?)', entities)

In [81]:
entities=(2,'Andrew',7000,'IT','Engineer','2015-04-06')

In [82]:
#calling sql insert to insert the data
sql_insert(con,entities)

In [83]:
entities=(3,'Thomas', 6000, 'HR', 'Manager', '2016-06-14')

In [84]:
sql_insert(con,entities)

In [85]:
results=cur.execute("select * from employee")
results.fetchall()

[(1, 'Jack', 9000.0, 'HR', 'Manager', '2019-07-09'),
 (2, 'Andrew', 7000.0, 'IT', 'Engineer', '2015-04-06'),
 (3, 'Thomas', 6000.0, 'HR', 'Manager', '2016-06-14')]

In [86]:
entities=(4, 'Rudolf', 8000, 'IT', 'Engineer', '2012-08-23')

In [87]:
sql_insert(con,entities)

In [88]:
entities=(5,'Suzen', 10000, 'Sales', 'Sales Executive', '2018-02-19')

In [89]:
sql_insert(con,entities)

In [90]:
results=cur.execute("select * from employee")
results.fetchall()

[(1, 'Jack', 9000.0, 'HR', 'Manager', '2019-07-09'),
 (2, 'Andrew', 7000.0, 'IT', 'Engineer', '2015-04-06'),
 (3, 'Thomas', 6000.0, 'HR', 'Manager', '2016-06-14'),
 (4, 'Rudolf', 8000.0, 'IT', 'Engineer', '2012-08-23'),
 (5, 'Suzen', 10000.0, 'Sales', 'Sales Executive', '2018-02-19')]

In [91]:
def sql_update(con):
    cur=con.cursor()
    cur.execute('update employee set name="Martin" where id=1')
    con.commit()
sql_update(con)

In [92]:
results=cur.execute("select * from employee")
results.fetchall()

[(1, 'Martin', 9000.0, 'HR', 'Manager', '2019-07-09'),
 (2, 'Andrew', 7000.0, 'IT', 'Engineer', '2015-04-06'),
 (3, 'Thomas', 6000.0, 'HR', 'Manager', '2016-06-14'),
 (4, 'Rudolf', 8000.0, 'IT', 'Engineer', '2012-08-23'),
 (5, 'Suzen', 10000.0, 'Sales', 'Sales Executive', '2018-02-19')]

In [93]:
results=cur.execute("select id,name from employee")
results.fetchall()

[(1, 'Martin'), (2, 'Andrew'), (3, 'Thomas'), (4, 'Rudolf'), (5, 'Suzen')]

In [94]:
results=cur.execute("select id, name from employee where salary >8000")
results.fetchall()

[(1, 'Martin'), (5, 'Suzen')]

In [95]:
results=cur.execute("select id, name from employee where department in ('HR')")
results.fetchall()

[(1, 'Martin'), (3, 'Thomas')]

In [96]:
results=cur.execute("select min(salary) from employee")
results.fetchone()

(6000.0,)

In [97]:
results=cur.execute("select count(id) from employee")
results.fetchone()

(5,)

In [98]:
results=cur.execute("select distinct (department)  from employee")
results.fetchall()

[('HR',), ('IT',), ('Sales',)]

In [99]:
results=cur.execute("select count(distinct (department))  from employee")
results.fetchall()

[(3,)]

In [100]:
results=cur.execute("select sum(salary), position from employee group by position")
results.fetchall()

[(15000.0, 'Engineer'), (15000.0, 'Manager'), (10000.0, 'Sales Executive')]

In [101]:
results=cur.execute("select sum(salary), department from employee group by department")
results.fetchall()

[(15000.0, 'HR'), (15000.0, 'IT'), (10000.0, 'Sales')]

In [102]:
def sql_query(sql):
    cur=con.cursor()
    results=cur.execute(sql)
    return results

In [103]:
#make query
sql="select * from employee"

In [104]:
#pass query in function
respond=sql_query(sql)
respond.fetchall()

[(1, 'Martin', 9000.0, 'HR', 'Manager', '2019-07-09'),
 (2, 'Andrew', 7000.0, 'IT', 'Engineer', '2015-04-06'),
 (3, 'Thomas', 6000.0, 'HR', 'Manager', '2016-06-14'),
 (4, 'Rudolf', 8000.0, 'IT', 'Engineer', '2012-08-23'),
 (5, 'Suzen', 10000.0, 'Sales', 'Sales Executive', '2018-02-19')]

In [105]:
sql="select id,name,position from employee"

In [106]:
#pass query in function
respond=sql_query(sql)
respond.fetchall()

[(1, 'Martin', 'Manager'),
 (2, 'Andrew', 'Engineer'),
 (3, 'Thomas', 'Manager'),
 (4, 'Rudolf', 'Engineer'),
 (5, 'Suzen', 'Sales Executive')]

In [107]:
#SQLite3 Executemany (Bulk insert)
#We can use the executemany statement to insert multiple rows at once.
entities=[(4, 'Joseph', 4000, 'Account','CA','2016-12-05'),(5,'Maria',10000,'Sales','Sales Executive','2018-05-25')]

In [111]:
cur.executemany('update into employee(id,name,salary,department,position,hiredate) values(?,?,?,?,?,?)', entities)

ProgrammingError: Cannot operate on a closed database.

In [112]:
results=cur.execute("Select * from employee")
for row in results:
    print(row)

ProgrammingError: Cannot operate on a closed database.

In [110]:
con.close()

In [113]:
import sqlite3

In [153]:
db=sqlite3.connect("C://Users/Admin/student_course_database2.db")
cur=db.cursor()

In [154]:
cur.execute("create table course(courseid int primary key,coursename text,duration int)")

In [155]:
cur.execute("create table student(roll_no int primary key, studentname text,age int, courseid int, foreign key(courseid) references course(courseid))")

In [156]:
cur.execute("insert into course values(78, 'Data science',12), (56, 'Python course',4), (101, 'Database',7)")
print(cur.rowcount, "record(s) inserted")
db.commit;

3 record(s) inserted

In [157]:
cur.execute("insert into student values(1, 'Jack',22,78), (2, 'John', 21,56), (3, 'Rudolf',18,78), (4, 'Jim',21,56)")
print(cur.rowcount,"record(s) inserted ")
db.commit;

4 record(s) inserted

In [158]:
results=cur.execute('select * from course')
results.fetchall()

[(78, 'Data science', 12), (56, 'Python course', 4), (101, 'Database', 7)]

In [159]:
results=cur.execute('select * from student')
results.fetchall()

[(1, 'Jack', 22, 78),
 (2, 'John', 21, 56),
 (3, 'Rudolf', 18, 78),
 (4, 'Jim', 21, 56)]

In [164]:
results=cur.execute('select courseid from course where coursename="Data science"')
for i in results:
    print(i)

(78,)

In [165]:
results=cur.execute('select * from student where courseid=(select courseid from course where coursename="Data science")')
results.fetchall()

[(1, 'Jack', 22, 78), (3, 'Rudolf', 18, 78)]

In [166]:
results=cur.execute('select * from student where courseid=(select courseid from course where coursename="Python course")')
results.fetchall()

[(2, 'John', 21, 56), (4, 'Jim', 21, 56)]

In [167]:
#Join
#Different types of SQL Joins
#(Inner) Join: Returns records that havematching value in both tables
#Left (outer) join : Returns all records from the left able and the matched records from the right table
#Right (outer) join : Returns all recordsfrom the right table, and the matched records from the left table.
#Full (outer) join : Returnds all records when there is a match in either left or right table
#INNER JOIN

In [170]:
sql = "SELECT student.roll_no, student.studentname, course.courseid, course.coursename FROM student INNER JOIN course ON student.courseid = course.courseid"

In [171]:
results = cur.execute(sql)
for row in results:
    print(row)

(1, 'Jack', 78, 'Data science')
(2, 'John', 56, 'Python course')
(3, 'Rudolf', 78, 'Data science')
(4, 'Jim', 56, 'Python course')

In [172]:
#LEFT JOIN
sql = "SELECT student.roll_no, student.studentname, course.courseid, course.coursename FROM student LEFT JOIN course ON student.courseid = course.courseid"

In [173]:
results = cur.execute(sql)
for row in results:
    print(row)

(1, 'Jack', 78, 'Data science')
(2, 'John', 56, 'Python course')
(3, 'Rudolf', 78, 'Data science')
(4, 'Jim', 56, 'Python course')

In [174]:
sql = "SELECT student.roll_no, student.studentname, course.courseid, course.coursename FROM course LEFT JOIN student ON student.courseid = course.courseid"

In [175]:
results = cur.execute(sql)
for row in results:
    print(row)

(1, 'Jack', 78, 'Data science')
(3, 'Rudolf', 78, 'Data science')
(2, 'John', 56, 'Python course')
(4, 'Jim', 56, 'Python course')
(None, None, 101, 'Database')